# CreateRibbonTab Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ApplicationEntryPoint..::..CreateRibbonTab Method
ApplicationEntryPoint Class See Also
---
**Namespace:** Autodesk.Revit.UI.Macros**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public override void CreateRibbonTab(
	string tabName
)
```

Visual Basic
---
```text
Public Overrides Sub CreateRibbonTab ( _
	tabName As String _
)
```

Visual C++
---
```text
public:
virtual void CreateRibbonTab(
	String^ tabName
) override
```

# ### Parameters
tabName
    Type: System..::..String
# See Also
ApplicationEntryPoint Class
Autodesk.Revit.UI.Macros Namespace